toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
#define TaskARM32
#include "Toastbox/Task.h"
#include "Toastbox/IntState.h"
#include "Assert.h"
#include "System.h"
#include "ICE.h"
#include "STM.h"
#include "USB.h"
#include "QSPI.h"
#include "BufQueue.h"
#include "SDCard.h"
#include "ImgSensor.h"
#include "USBConfigDesc.h"
#include "MSP430JTAG.h"
using namespace STM;

// MARK: - Peripherals & Types

static const void* _USBConfigDesc(size_t& len);

using _USBType = USBType<
    true,                       // T_DMAEn
    _USBConfigDesc,             // T_ConfigDesc
    STM::Endpoints::DataOut,    // T_Endpoints
    STM::Endpoints::DataIn
>;

static const void* _USBConfigDesc(size_t& len) {
    return USBConfigDesc<_USBType>(len);
}

static struct {
    QSPI::Config ICEWrite = {
        .mode       = QSPI::Mode::Single,
        .clkDivider = 5, // clkDivider: 5 -> QSPI clock = 21.3 MHz
        .align      = QSPI::Align::Byte,
        .chipSelect = QSPI::ChipSelect::Controlled,
    };
    
    QSPI::Config ICEApp = {
        .mode       = QSPI::Mode::Dual,
        .clkDivider = 1, // clkDivider: 1 -> QSPI clock = 64 MHz)
        .align      = QSPI::Align::Word,
        .chipSelect = QSPI::ChipSelect::Uncontrolled,
    };
} _QSPIConfig;

static QSPI _QSPI;

// We're using 63K buffers instead of 64K, because the
// max DMA transfer is 65535 bytes, not 65536.
using _BufQueue = BufQueue<uint8_t,63*1024,2>;

#warning TODO: were not putting the _BufQueue code in .sram1 too are we?
[[gnu::section(".sram1")]]
static _BufQueue _Bufs;

struct _TaskUSBDataOut;
struct _TaskUSBDataIn;
struct _TaskReadout;

static void _CmdHandle(const STM::Cmd& cmd);
using _System = System<
    _USBType,
    STM::Status::Modes::STMApp,
    _CmdHandle,
    // Additional Tasks
    _TaskUSBDataOut,
    _TaskUSBDataIn,
    _TaskReadout
>;

constexpr auto& _USB = _System::USB;
using _Scheduler = _System::Scheduler;

using _ICE_CRST_ = GPIO<GPIOPortI, GPIO_PIN_6>;
using _ICE_CDONE = GPIO<GPIOPortI, GPIO_PIN_7>;

using _ICE_ST_SPI_CLK = GPIO<GPIOPortB, GPIO_PIN_2>;
using _ICE_ST_SPI_CS_ = GPIO<GPIOPortB, GPIO_PIN_6>;
using _ICE_ST_SPI_D_READY = GPIO<GPIOPortF, GPIO_PIN_14>;

[[noreturn]] static void _ICEError(uint16_t line);
using _ICE = ::ICE<_Scheduler, _ICEError>;

static bool _ImgSetPowerEnabled(bool en);
[[noreturn]] static void _ImgError(uint16_t line);
using _ImgSensor = Img::Sensor<
    _System::Scheduler,     // T_Scheduler
    _ICE,                   // T_ICE
    _ImgSetPowerEnabled,    // T_SetPowerEnabled
    _ImgError               // T_Error
>;

static bool _SDSetPowerEnabled(bool en);
[[noreturn]] static void _SDError(uint16_t line);
using _SDCard = SD::Card<
    _System::Scheduler, // T_Scheduler
    _ICE,               // T_ICE
    _SDSetPowerEnabled, // T_SetPowerEnabled
    _SDError,           // T_Error
    1,                  // T_ClkDelaySlow (odd values invert the clock)
    0                   // T_ClkDelayFast (odd values invert the clock)
>;

// MARK: - ICE40

namespace _QSPICmd {

static QSPI_CommandTypeDef ICEWrite(size_t len) {
    return QSPI_CommandTypeDef{
        .Instruction = 0,
        .InstructionMode = QSPI_INSTRUCTION_NONE,
        
        .Address = 0,
        .AddressSize = QSPI_ADDRESS_8_BITS,
        .AddressMode = QSPI_ADDRESS_NONE,
        
        .AlternateBytes = 0,
        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_8_BITS,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
        
        .DummyCycles = 0,
        
        .NbData = (uint32_t)len,
        .DataMode = QSPI_DATA_1_LINE,
        
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

static QSPI_CommandTypeDef ICEApp(const _ICE::Msg& msg, size_t respLen) {
    uint8_t b[8];
    static_assert(sizeof(msg) == sizeof(b));
    memcpy(b, &msg, sizeof(b));
    
    // When dual-flash quadspi is enabled, the supplied address is
    // divided by 2, so we left-shift `addr` in anticipation of that.
    // By doing so, we throw out the high bit of `msg`, however we
    // wrote the ICE40 Verilog to fake the first bit as 1, so verify
    // that the first bit is indeed 1.
    AssertArg(b[0] & 0x80);
    
    return QSPI_CommandTypeDef{
        // Use instruction stage to introduce 2 dummy cycles, to workaround an
        // apparent STM32 bug that always sends the first nibble as 0xF.
        .Instruction = 0x00,
        .InstructionMode = QSPI_INSTRUCTION_4_LINES,
        
        // When dual-flash quadspi is enabled, the supplied address is
        // divided by 2, so we left-shift `addr` in anticipation of that.
        .Address = (
            (uint32_t)b[0]<<24  |
            (uint32_t)b[1]<<16  |
            (uint32_t)b[2]<<8   |
            (uint32_t)b[3]<<0
        ) << 1,
//            .Address = 0,
        .AddressSize = QSPI_ADDRESS_32_BITS,
        .AddressMode = QSPI_ADDRESS_4_LINES,
        
        .AlternateBytes = (
            (uint32_t)b[4]<<24  |
            (uint32_t)b[5]<<16  |
            (uint32_t)b[6]<<8   |
            (uint32_t)b[7]<<0
        ),
//            .AlternateBytes = 0,
        .AlternateBytesSize = QSPI_ALTERNATE_BYTES_32_BITS,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_4_LINES,
        
        .DummyCycles = 4,
        
        .NbData = (uint32_t)respLen,
        .DataMode = (respLen ? QSPI_DATA_4_LINES : QSPI_DATA_NONE),
        
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

static QSPI_CommandTypeDef ICEAppReadOnly(size_t len) {
    return QSPI_CommandTypeDef{
        .InstructionMode = QSPI_INSTRUCTION_NONE,
        .AddressMode = QSPI_ADDRESS_NONE,
        .AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
        .DummyCycles = 8,
        .NbData = (uint32_t)len,
        .DataMode = QSPI_DATA_4_LINES,
        .DdrMode = QSPI_DDR_MODE_DISABLE,
        .DdrHoldHalfCycle = QSPI_DDR_HHC_ANALOG_DELAY,
        .SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
    };
}

} // namespace _QSPICmd

template<>
void _ICE::Transfer(const Msg& msg, Resp* resp) {
    AssertArg((bool)resp == (bool)(msg.type & _ICE::MsgType::Resp));
    
    _ICE_ST_SPI_CS_::Write(0);
    if (resp) {
        _QSPI.read(_QSPICmd::ICEApp(msg, sizeof(*resp)), resp);
    } else {
        _QSPI.command(_QSPICmd::ICEApp(msg, 0));
    }
    _Scheduler::Wait([] { return _QSPI.ready(); });
    _ICE_ST_SPI_CS_::Write(1);
}

[[noreturn]]
static void _ICEError(uint16_t line) {
    _System::Abort();
}

// MARK: - MSP430

using _MSPTest = GPIO<GPIOPortB, GPIO_PIN_1>;
using _MSPRst_ = GPIO<GPIOPortB, GPIO_PIN_0>;
static MSP430JTAG<_MSPTest, _MSPRst_, _System::CPUFreqMHz> _MSP;

//static void _MSPInit() {
////    static bool init = false;
////    if (init) return; // Short-circuit if we're already initialized
////    init = true;
//    
//    constexpr uint16_t PM5CTL0  = 0x0130;
//    constexpr uint16_t PAOUT    = 0x0202;
//    
//    // Init MSP
//    _MSP.init();
//    
//    auto s = _MSP.connect();
//    Assert(s == _MSP.Status::OK);
//    
//    // Clear LOCKLPM5 in the PM5CTL0 register
//    // This is necessary to be able to control the GPIOs
//    _MSP.write(PM5CTL0, 0x0010);
//    
//    // Clear PAOUT so everything is driven to 0 by default
//    _MSP.write(PAOUT, 0x0000);
//}

// MARK: - SD Card

static bool _SDSetPowerEnabled(bool en) {
    constexpr uint16_t BITB         = 1<<0xB;
    constexpr uint16_t VDD_SD_EN    = BITB;
    constexpr uint16_t PADIRAddr    = 0x0204;
    constexpr uint16_t PAOUTAddr    = 0x0202;
    
    const uint16_t PADIR = _MSP.read(PADIRAddr);
    const uint16_t PAOUT = _MSP.read(PAOUTAddr);
    _MSP.write(PADIRAddr, PADIR | VDD_SD_EN);
    
    if (en) {
        _MSP.write(PAOUTAddr, PAOUT | VDD_SD_EN);
    } else {
        _MSP.write(PAOUTAddr, PAOUT & ~VDD_SD_EN);
    }
    
    // The TPS22919 takes 1ms for VDD to reach 2.8V (empirically measured)
    _Scheduler::Sleep(_Scheduler::Ms(2));
    return true;
}

[[noreturn]]
static void _SDError(uint16_t line) {
    _System::Abort();
}

static bool _ImgSetPowerEnabled(bool en) {
    constexpr uint16_t BIT0             = 1<<0;
    constexpr uint16_t BIT2             = 1<<2;
    constexpr uint16_t VDD_1V9_IMG_EN   = BIT0;
    constexpr uint16_t VDD_2V8_IMG_EN   = BIT2;
    constexpr uint16_t PADIRAddr        = 0x0204;
    constexpr uint16_t PAOUTAddr        = 0x0202;
    
    const uint16_t PADIR = _MSP.read(PADIRAddr);
    const uint16_t PAOUT = _MSP.read(PAOUTAddr);
    _MSP.write(PADIRAddr, PADIR | (VDD_2V8_IMG_EN | VDD_1V9_IMG_EN));
    
    if (en) {
        _MSP.write(PAOUTAddr, PAOUT | (VDD_2V8_IMG_EN));
        _Scheduler::Sleep(_Scheduler::Ms(1)); // 100us delay needed between power on of VAA (2V8) and VDD_IO (1V9)
        _MSP.write(PAOUTAddr, PAOUT | (VDD_2V8_IMG_EN|VDD_1V9_IMG_EN));
    
    } else {
        // No delay between 2V8/1V9 needed for power down (per AR0330CS datasheet)
        _MSP.write(PAOUTAddr, PAOUT & ~(VDD_2V8_IMG_EN|VDD_1V9_IMG_EN));
    }
    
    #warning TODO: measure how long it takes for IMG rails to rise
    // The TPS22919 takes 1ms for VDD_2V8_IMG VDD to reach 2.8V (empirically measured)
    _Scheduler::Sleep(_Scheduler::Ms(2));
    
