toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    return true;
}

[[noreturn]]
static void _ImgError(uint16_t line) {
    _System::Abort();
}

// MARK: - Tasks

// _TaskUSBDataOut: reads `len` bytes from the DataOut endpoint and writes them to _Bufs
struct _TaskUSBDataOut {
    static void Start(size_t l) {
        // Make sure this task isn't busy
        Assert(!_Scheduler::Running<_TaskUSBDataOut>());
        
        static size_t len = 0;
        len = l;
        _Scheduler::Start<_TaskUSBDataOut>([] {
            while (len) {
                _Scheduler::Wait([] { return !_Bufs.full(); });
                
                auto& buf = _Bufs.back();
                // Prepare to receive either `len` bytes or the
                // buffer capacity bytes, whichever is smaller.
                const size_t cap = _USB.CeilToMaxPacketSize(_USB.MaxPacketSizeOut(), std::min(len, sizeof(buf.data)));
                // Ensure that after rounding up to the nearest packet size, we don't
                // exceed the buffer capacity. (This should always be safe as long as
                // the buffer capacity is a multiple of the max packet size.)
                Assert(cap <= sizeof(buf.data));
                _USB.recv(Endpoints::DataOut, buf.data, cap);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
                
                // Never claim that we read more than the requested data, even if ceiling
                // to the max packet size caused us to read more than requested.
                const size_t recvLen = std::min(len, _USB.recvLen(Endpoints::DataOut));
                len -= recvLen;
                buf.len = recvLen;
                _Bufs.push();
            }
        });
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._TaskUSBDataOut")]]
    static inline uint8_t Stack[256];
};

// _TaskUSBDataIn: writes buffers from _Bufs to the DataIn endpoint, and pops them from _Bufs
struct _TaskUSBDataIn {
    static void Start() {
        _Scheduler::Start<_TaskUSBDataIn>([] {
            for (;;) {
                _Scheduler::Wait([] { return !_Bufs.empty(); });
                
                // Send the data and wait until the transfer is complete
                auto& buf = _Bufs.front();
                _USB.send(Endpoints::DataIn, buf.data, buf.len);
                _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
                
                buf.len = 0;
                _Bufs.pop();
            }
        });
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{};
    
    // Task stack
    [[gnu::section(".stack._TaskUSBDataIn")]]
    static inline uint8_t Stack[256];
};

// _TaskReadout:
struct _TaskReadout {
    static void Start(std::optional<size_t> len) {
        static std::optional<size_t> remLen;
        remLen = len;
        
        _Scheduler::Start<_TaskReadout>([] {
            // Reset state
            _Bufs.reset();
            // Start the USB DataIn task
            _TaskUSBDataIn::Start();
            
            // Send the Readout message, which causes us to enter the readout mode until
            // we release the chip select
            _ICE_ST_SPI_CS_::Write(0);
            _QSPI.command(_QSPICmd::ICEApp(_ICE::ReadoutMsg(), 0));
            
            // Read data over QSPI and write it to USB, indefinitely
            for (;;) {
                // Wait until: there's an available buffer, QSPI is ready, and ICE40 says data is available
                _Scheduler::Wait([] { return !_Bufs.full() && _QSPI.ready(); });
                
                const size_t len = std::min(remLen.value_or(SIZE_MAX), _ICE::ReadoutMsg::ReadoutLen);
                auto& buf = _Bufs.back();
                
                // If there's no more data to read, bail
                if (!len) {
                    // Before bailing, push the final buffer if it holds data
                    if (buf.len) _Bufs.push();
                    break;
                }
                
                // If we can't read any more data into the producer buffer,
                // push it so the data will be sent over USB
                if (sizeof(buf.data)-buf.len < len) {
                    _Bufs.push();
                    continue;
                }
                
                // Wait until ICE40 signals that data is ready to be read
                #warning TODO: we should institute yield after some number of retries to avoid crashing the system if we never get data
                while (!_ICE_ST_SPI_D_READY::Read());
                
                _QSPI.read(_QSPICmd::ICEAppReadOnly(len), buf.data+buf.len);
                buf.len += len;
                
                if (remLen) *remLen -= len;
            }
        });
    }
    
    static void DidStop() {
        // De-assert the SPI chip select when the _TaskReadout is stopped.
        // This is necessary because the _TaskReadout asserts the SPI chip select,
        // but never deasserts it because _TaskReadout continues indefinitely.
        _ICE_ST_SPI_CS_::Write(1);
    }
    
    // Task options
    static constexpr Toastbox::TaskOptions Options{
        .DidStop = DidStop,
    };
    
    // Task stack
    [[gnu::section(".stack._TaskReadout")]]
    static inline uint8_t Stack[512];
};

// MARK: - Commands

static void _ICEWrite(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.ICEWrite;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure ICE40 control GPIOs
    _ICE_CRST_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_CDONE::Config(GPIO_MODE_INPUT, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CLK::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    _ICE_ST_SPI_CS_::Config(GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0);
    
    // Put ICE40 into configuration mode
    _ICE_ST_SPI_CLK::Write(1);
    
    _ICE_ST_SPI_CS_::Write(0);
    _ICE_CRST_::Write(0);
    _Scheduler::Sleep(_Scheduler::Ms(1)); // Sleep 1 ms (ideally, 200 ns)
    
    _ICE_CRST_::Write(1);
    _Scheduler::Sleep(_Scheduler::Ms(2)); // Sleep 2 ms (ideally, 1.2 ms for 8K devices)
    
