toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
    // Release chip-select before we give control of _ICE_ST_SPI_CLK/_ICE_ST_SPI_CS_ to QSPI
    _ICE_ST_SPI_CS_::Write(1);
    
    // Configure QSPI for writing the ICE40 configuration
    _QSPI.config(_QSPIConfig.ICEWrite);
    
    // Send 8 clocks and wait for them to complete
    static const uint8_t ff = 0xff;
    _QSPI.write(_QSPICmd::ICEWrite(sizeof(ff)), &ff);
    _Scheduler::Wait([] { return _QSPI.ready(); });
    
    // Reset state
    _Bufs.reset();
    
    size_t len = arg.len;
    // Trigger the USB DataOut task with the amount of data
    _TaskUSBDataOut::Start(len);
    
    while (len) {
        // Wait until we have data to consume, and QSPI is ready to write
        _Scheduler::Wait([] { return !_Bufs.empty() && _QSPI.ready(); });
        
        // Write the data over QSPI and wait for completion
        _QSPI.write(_QSPICmd::ICEWrite(_Bufs.front().len), _Bufs.front().data);
        _Scheduler::Wait([] { return _QSPI.ready(); });
        
        // Update the remaining data and pop the buffer so it can be used again
        len -= _Bufs.front().len;
        _Bufs.pop();
    }
    
    // Wait for CDONE to be asserted
    {
        bool ok = false;
        for (int i=0; i<10 && !ok; i++) {
            if (i) _Scheduler::Sleep(_Scheduler::Ms(1)); // Sleep 1 ms
            ok = _ICE_CDONE::Read();
        }
        
        if (!ok) {
            _System::USBSendStatus(false);
            return;
        }
    }
    
    // Finish
    {
        // Supply >=49 additional clocks (8*7=56 clocks), per the
        // "iCE40 Programming and Configuration" guide.
        // These clocks apparently reach the user application. Since this
        // appears unavoidable, prevent the clocks from affecting the user
        // application in two ways:
        //   1. write 0xFF, which the user application must consider as a NOP;
        //   2. write a byte at a time, causing chip-select to be de-asserted
        //      between bytes, which must cause the user application to reset
        //      itself.
        constexpr uint8_t ClockCount = 7;
        static int i;
        for (i=0; i<ClockCount; i++) {
            _QSPI.write(_QSPICmd::ICEWrite(sizeof(ff)), &ff);
            _Scheduler::Wait([] { return _QSPI.ready(); });
        }
    }
    
    _System::USBSendStatus(true);
}

static void _MSPConnect(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    const auto r = _MSP.connect();
    // Send status
    _System::USBSendStatus(r == _MSP.Status::OK);
}

static void _MSPDisconnect(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    _MSP.disconnect();
    // Send status
    _System::USBSendStatus(true);
}

static void _MSPRead(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPRead;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    
    // Start the USB DataIn task
    _TaskUSBDataIn::Start();
    
    uint32_t addr = arg.addr;
    uint32_t len = arg.len;
    while (len) {
        _Scheduler::Wait([] { return !_Bufs.full(); });
        
        auto& buf = _Bufs.back();
        // Prepare to receive either `len` bytes or the
        // buffer capacity bytes, whichever is smaller.
        const size_t chunkLen = std::min((size_t)len, sizeof(buf.data));
        _MSP.read(addr, buf.data, chunkLen);
        addr += chunkLen;
        len -= chunkLen;
        // Enqueue the buffer
        buf.len = chunkLen;
        _Bufs.push();
    }
    
    // Wait for DataIn task to complete
    _Scheduler::Wait([] { return _Bufs.empty(); });
    // Send status
    _System::USBSendStatus(true);
}

static void _MSPWrite(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPWrite;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    _MSP.crcReset();
    
    uint32_t addr = arg.addr;
    uint32_t len = arg.len;
    
    // Trigger the USB DataOut task with the amount of data
    _TaskUSBDataOut::Start(len);
    
    while (len) {
        _Scheduler::Wait([] { return !_Bufs.empty(); });
        
        // Write the data over Spy-bi-wire
        auto& buf = _Bufs.front();
        _MSP.write(addr, buf.data, buf.len);
        // Update the MSP430 address to write to
        addr += buf.len;
        len -= buf.len;
        // Pop the buffer, which we just finished sending over Spy-bi-wire
        _Bufs.pop();
    }
    
    // Verify the CRC of all the data we wrote
    const auto r = _MSP.crcVerify();
    // Send status
    _System::USBSendStatus(r == _MSP.Status::OK);
}

struct _MSPDebugState {
    uint8_t bits = 0;
    uint8_t bitsLen = 0;
    size_t len = 0;
    bool ok = true;
};

static void _MSPDebugPushReadBits(_MSPDebugState& state, _BufQueue::Buf& buf) {
    if (state.len >= sizeof(buf.data)) {
        state.ok = false;
        return;
    }
    
    // Enqueue the new byte into `buf`
    buf.data[state.len] = state.bits;
    state.len++;
    // Reset our bits
    state.bits = 0;
    state.bitsLen = 0;
}

static void _MSPDebugHandleSBWIO(const MSPDebugCmd& cmd, _MSPDebugState& state, _BufQueue::Buf& buf) {
    const bool tdo = _MSP.debugSBWIO(cmd.tmsGet(), cmd.tclkGet(), cmd.tdiGet());
    if (cmd.tdoReadGet()) {
        // Enqueue a new bit
        state.bits <<= 1;
        state.bits |= tdo;
        state.bitsLen++;
        
        // Enqueue the byte if it's filled
        if (state.bitsLen == 8) {
            _MSPDebugPushReadBits(state, buf);
        }
    }
}

static void _MSPDebugHandleCmd(const MSPDebugCmd& cmd, _MSPDebugState& state, _BufQueue::Buf& buf) {
    switch (cmd.opGet()) {
    case MSPDebugCmd::Ops::TestSet:     _MSP.debugTestSet(cmd.pinValGet());     break;
    case MSPDebugCmd::Ops::RstSet:      _MSP.debugRstSet(cmd.pinValGet()); 	    break;
    case MSPDebugCmd::Ops::TestPulse:   _MSP.debugTestPulse(); 				    break;
    case MSPDebugCmd::Ops::SBWIO:       _MSPDebugHandleSBWIO(cmd, state, buf);	break;
    default:                            abort();
    }
}

static void _MSPDebug(const STM::Cmd& cmd) {
    auto& arg = cmd.arg.MSPDebug;
    
    // Bail if more data was requested than the size of our buffer
    if (arg.respLen > sizeof(_BufQueue::Buf::data)) {
        // Reject command
        _System::USBAcceptCommand(false);
        return;
    }
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Reset state
    _Bufs.reset();
    auto& bufIn = _Bufs.back();
    _Bufs.push();
    auto& bufOut = _Bufs.back();
    
    _MSPDebugState state;
    
    // Handle debug commands
    {
        size_t cmdsLenRem = arg.cmdsLen;
        while (cmdsLenRem) {
            // Receive debug commands into buf
            _USB.recv(Endpoints::DataOut, bufIn.data, sizeof(bufIn.data));
            _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataOut); });
            
