toasterllc/MDCCode/Code/STM32/STApp/Source/main.cpp
            // Handle each MSPDebugCmd
            const MSPDebugCmd* cmds = (MSPDebugCmd*)bufIn.data;
            const size_t cmdsLen = _USB.recvLen(Endpoints::DataOut) / sizeof(MSPDebugCmd);
            for (size_t i=0; i<cmdsLen && state.ok; i++) {
                _MSPDebugHandleCmd(cmds[i], state, bufOut);
            }
            
            cmdsLenRem -= cmdsLen;
        }
    }
    
    // Reply with data generated from debug commands
    {
        // Push outstanding bits into the buffer
        // This is necessary for when the client reads a number of bits
        // that didn't fall on a byte boundary.
        if (state.bitsLen) _MSPDebugPushReadBits(state, bufOut);
        
        if (arg.respLen) {
            // Send the data and wait for it to be received
            _USB.send(Endpoints::DataIn, bufOut.data, arg.respLen);
            _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
        }
    }
    
    // Send status
    _System::USBSendStatus(state.ok);
}

class _SD {
public:
    static void Enable() {
        if (_Enabled) return; // Short-circuit
        _Enabled = true;
        _RCA = _SDCard::Enable(&_CardId, nullptr);
    }
    
    static void Disable() {
        if (!_Enabled) return; // Short-circuit
        _Enabled = false;
        _SDCard::Disable();
    }
    
    static const SD::CardId& CardId() {
        return _CardId;
    }
    
private:
    static inline bool _Enabled = false;
    static inline uint16_t _RCA = 0;
    alignas(4) static inline SD::CardId _CardId; // Aligned to send via USB
};

void _SDInit(const STM::Cmd& cmd) {
    constexpr uint16_t PM5CTL0  = 0x0130;
    constexpr uint16_t PAOUT    = 0x0202;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    auto s = _MSP.connect();
    if (s != _MSP.Status::OK) {
        // Bail if we fail to connect to MSP
        _System::USBSendStatus(false);
        return;
    }
    
    // Clear LOCKLPM5 in the PM5CTL0 register
    // This is necessary to be able to control the GPIOs
    _MSP.write(PM5CTL0, 0x0010);
    
    // Clear PAOUT so everything is driven to 0 by default
    _MSP.write(PAOUT, 0x0000);
    
    static bool init = false;
    if (init) return;
    _ImgSensor::Enable();
    _ImgSensor::SetStreamEnabled(true);
    init = true;
}

static void _SDCardIdGet(const STM::Cmd& cmd) {
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure QSPI for comms with ICEApp
    _QSPI.config(_QSPIConfig.ICEApp);
    
    // Enable the SD card
    _SD::Enable();
    
    // Send SD card id
    // cardId: aligned to send via USB
    _USB.send(Endpoints::DataIn, &_SD.CardId(), sizeof(_SD.CardId()));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    // Send status
    _System::USBSendStatus(true);
}

//static void _SDCardDataGet(const STM::Cmd& cmd) {
//    // Accept command
//    _System::USBAcceptCommand(true);
//    
//    // Configure QSPI for comms with ICEApp
//    _QSPI.config(_QSPIConfig.ICEApp);
//    
//    // Enable the SD card
//    _SD::Enable();
//    
//    // Send SD card data
//    _USB.send(Endpoints::DataIn, &_SD.CardId(), sizeof(_SD.CardId()));
//    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
//    
//    // Send status
//    _System::USBSendStatus(true);
//}

static void _SDRead(const STM::Cmd& cmd) {
    static bool reading = false;
    const auto& arg = cmd.arg.SDRead;
    
    // Verify that the address is a multiple of the SD block length
    if (arg.addr % SD::BlockLen) {
        // Reject command
        _System::USBAcceptCommand(false);
        return;
    }
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure QSPI for comms with ICEApp
    _QSPI.config(_QSPIConfig.ICEApp);
    
    // Enable the SD card
    _SD::Enable();
    
    // Stop reading from the SD card if a read is in progress
    if (reading) {
        _ICE_ST_SPI_CS_::Write(1);
        _SDCard.readStop();
        reading = false;
    }
    
    // Update state
    reading = true;
    _SDCard.readStart(arg.addr);
    
    // Start the Readout task
    _TaskReadout::Start(std::nullopt);
    
    // Send status
    _System::USBSendStatus(true);
}

void _ImgInit(const STM::Cmd& cmd) {
    constexpr uint16_t PM5CTL0  = 0x0130;
    constexpr uint16_t PAOUT    = 0x0202;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    auto s = _MSP.connect();
    if (s != _MSP.Status::OK) {
        // Bail if we fail to connect to MSP
        _System::USBSendStatus(false);
        return;
    }
    
    // Clear LOCKLPM5 in the PM5CTL0 register
    // This is necessary to be able to control the GPIOs
    _MSP.write(PM5CTL0, 0x0010);
    
    // Clear PAOUT so everything is driven to 0 by default
    _MSP.write(PAOUT, 0x0000);
    
    
    static bool init = false;
    if (init) return;
    _ImgSensor::Enable();
    _ImgSensor::SetStreamEnabled(true);
    init = true;
}

void _ImgExposureSet(const STM::Cmd& cmd) {
    const auto& arg = cmd.arg.ImgExposureSet;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure QSPI for comms with ICEApp
    _QSPI.config(_QSPIConfig.ICEApp);
    
    _ImgInit();
    _ImgSensor::SetCoarseIntTime(arg.coarseIntTime);
    _ImgSensor::SetFineIntTime(arg.fineIntTime);
    _ImgSensor::SetAnalogGain(arg.analogGain);
    
    // Send status
    _System::USBSendStatus(true);
}

void _ImgCapture(const STM::Cmd& cmd) {
    const auto& arg = cmd.arg.ImgCapture;
    
    // Accept command
    _System::USBAcceptCommand(true);
    
    // Configure QSPI for comms with ICEApp
    _QSPI.config(_QSPIConfig.ICEApp);
    
    _ImgInit();
    
    const Img::Header header = {
        .magic          = Img::Header::MagicNumber,
        .version        = Img::Header::Version,
        .imageWidth     = Img::PixelWidth,
        .imageHeight    = Img::PixelHeight,
    };
    
    const _ICE::ImgCaptureStatusResp resp = _ICE::ImgCapture(header, arg.dstBlock, arg.skipCount);
    
    // stats: aligned to send via USB
    alignas(4) const ImgCaptureStats stats = {
        .len            = resp.wordCount()*sizeof(Img::Word),
        .highlightCount = resp.highlightCount(),
        .shadowCount    = resp.shadowCount(),
    };
    
    // Send ImgCaptureStats
    _USB.send(Endpoints::DataIn, &stats, sizeof(stats));
    _Scheduler::Wait([] { return _USB.endpointReady(Endpoints::DataIn); });
    
    // Arrange for the image to be read out
    _ICE::Transfer(_ICE::ImgReadoutMsg(arg.dstBlock));
    
